{
  "schema_version": "1.0",
  "source": "linkedin",
  "profile": {
    "name": {
      "given": "Andrei-Claudiu",
      "family": "Roibu",
      "display": "Andrei-Claudiu Roibu"
    },
    "location": {
      "city": "Zurich",
      "canton": "ZH",
      "country": "Switzerland",
      "address": null
    },
    "contacts": {
      "phone_e164": "+41782419317",
      "email": "andreiroibu@icloud.com"
    },
    "personal": {
      "dob_iso": null,
      "nationality_iso2": [],
      "permit": {
        "type": "None",
        "expiry": null
      }
    },
    "links": [
      {
        "label": "Website",
        "url": "https://andreiroibu.com"
      },
      {
        "label": "LinkedIn",
        "url": "https://linkedin.com/in/andreiroibu"
      },
      {
        "label": "GitHub (Personal)",
        "url": "https://github.com/AndreiRoibu"
      },
      {
        "label": "GitHub (Work)",
        "url": "https://github.com/AndreiRoibu-synthara"
      }
    ],
    "photo_ref": null
  },
  "consents": {
    "photo": false,
    "full_address": false,
    "dob": false
  },
  "availability": {
    "type": "immediate",
    "date": null,
    "notice_days": null
  },
  "summary_raw": "I am an applied AI specialist and DPhil graduate from the University of Oxford who thrives at the intersection of deep research, hardware-aware engineering, business communication, and commercial strategy. My focus is on translating complex technological breakthroughs, from AI applied to multimodal neuroimaging to in-memory computing, into scalable, market-ready solutions that solve critical industry challenges. I have a consistent track record of delivering substantial impact: ◆ Driving Technical Innovation: At Synthara AG, I helped pioneer the deployment of advanced AI and signal-processing algorithms for novel in-memory computing IP, delivering a 100x performance and efficiency gain. This work resulted in a pending patent and established a new technological benchmark for the company. ◆ Advancing Healthcare AI: As a Doctoral Researcher and in collaboration with Roche Pharma and GE Healthcare, I developed open-source software that boosted Alzheimer's imaging segmentation accuracy by 12%, accelerated analysis speeds by 90%, and developed AI models that identified 191 statistically significant factors in brain aging. ◆ Commercializing Research: At Rolls-Royce, I employed agent-based models to simulate market dynamics for hybrid-electric aircraft. My analysis and strategic recommendations directly enabled the establishment of two new business branches valued at over $840M per year. I am driven by the challenge of building, mentoring, and leading teams to tackle ambitious deep-tech problems. I seek opportunities in technical leadership or strategic roles to leverage my full-stack expertise to build transformative products and ventures. Core Competencies: Artificial Intelligence (AI) & Deep Learning (CNNs, LLMs, RL) | Embedded Systems & In-Memory Computing | Business Development & Go-to-Market Strategy | Multimodal Data Science (Neuroimaging, Signal Processing) | R&D Commercialization | Project Leadership Let's connect if you:- can teach me something new and mentor me- feel that I could advise you in your early career- are facing an engineering problem that my skills could support",
  "skills": {
    "groups": [
      {
        "name": "AI/ML",
        "items": [
          "Artificial Intelligence (AI)",
          "Deep Learning",
          "Large Language Models (LLM)",
          "Research",
          "Model Training",
          "Data Science",
          "Transformers"
        ]
      },
      {
        "name": "Embedded/Edge",
        "items": [
          "Embedded Systems"
        ]
      },
      {
        "name": "Cloud/Infra",
        "items": [
          "Azure",
          "Slurm"
        ]
      },
      {
        "name": "Business",
        "items": [
          "Business Development",
          "Entrepreneurship",
          "Go-to-Market Strategy",
          "Teamwork",
          "Business Planning",
          "Management",
          "Project Management",
          "Leadership",
          "Public Speaking",
          "Communication",
          "Presentation Skills",
          "Problem Solving",
          "Time Management"
        ]
      },
      {
        "name": "Software",
        "items": [
          "Engineering",
          "Software Engineering",
          "System Architect",
          "Signal Processing",
          "Git",
          "PyTorch",
          "TensorFlow",
          "Python",
          "CFD",
          "C++",
          "Numerical Analysis",
          "Mathematics",
          "Neuroimaging",
          "Matlab",
          "Computer Vision"
        ]
      }
    ],
    "keywords_raw": [
      "Artificial Intelligence (AI)",
      "Business Development",
      "Embedded Systems",
      "Deep Learning",
      "Engineering",
      "Entrepreneurship",
      "Large Language Models (LLM)",
      "System Architect",
      "Research",
      "Signal Processing",
      "Go-to-Market Strategy",
      "Teamwork",
      "Git",
      "Business Planning",
      "Model Training",
      "Management",
      "PyTorch",
      "TensorFlow",
      "Project Management",
      "Python",
      "Leadership",
      "Public Speaking",
      "CFD",
      "Data Science",
      "C++",
      "Communication",
      "Transformers",
      "Numerical Analysis",
      "Aerospace Engineering",
      "Mathematics",
      "Presetation Skills",
      "Neuroimaging",
      "Matlab",
      "Problem Solving",
      "Computer Vision",
      "Time Management",
      "Presentation Skills",
      "Client Engagement"
    ]
  },
  "experience": [
    {
      "id": "exp-1",
      "title": "Field Application Engineer",
      "company": "Synthara AG",
      "location": "Zurich, Switzerland",
      "start": "2023-09",
      "end": null,
      "current": true,
      "bullets_raw": [
        "Unlocked 100x performance and efficiency gains by pioneering optimized advanced AI, LLM, and signal processing algorithms for the company's in-memory computing IP; this work also resulted in a pending patent.",
        "Accelerated product development cycles by 90% by co-developing an embedded emulation pipeline that enabled rapid prototyping, benchmarking, and deployment of complex multimodal AI workloads.",
        "Spearheaded market expansion and business development initiatives, sourcing and managing 60+ technical leads and generating a qualified pipeline.",
        "Acted as a key strategic partner to executive leadership (CEO, CTO, Heads of Sales & Software), influencing company growth strategy and shaping the technical product roadmap.",
        "Drove this strategy by translating critical feedback from 10+ key client engagements into actionable engineering features, ensuring tight product-market alignment.",
        "Expanded global brand visibility by delivering keynote presentations and technical workshops on in-memory computing to diverse audiences at five international conferences.",
        "Directed cross-functional projects from concept to completion, utilizing agile methodologies to ensure the on-time, on-budget delivery of 25+ benchmarks and PoCs.",
        "Mentored and developed four junior engineers in advanced problem-solving and technical communication, leading to increased team autonomy and faster project execution.",
        "Enabled the sales and marketing teams by creating a comprehensive suite of client-focused technical documentation, from application notes and datasheets to product positioning guides."
      ],
      "tech": [
        "AI",
        "LLM",
        "signal processing",
        "in-memory computing",
        "embedded emulation",
        "agile methodologies",
        "product-market alignment"
      ]
    },
    {
      "id": "exp-2",
      "title": "Doctoral Researcher — Quantifying Brain Ageing using AI and Multi-Modal Neuroimaging",
      "company": "University of Oxford",
      "location": "Oxford, United Kingdom",
      "start": "2019-10",
      "end": "2024-12",
      "current": false,
      "bullets_raw": [
        "Discovered 191 statistically significant factors and 57 potential new biomarkers in brain aging by applying novel multimodal AI techniques to large-scale 3D neuroimaging datasets.",
        "Engineered this research's foundational AI and data science technology, including novel data-fusion algorithms, LLM-based vision language models, and end-to-end data pipelines for 3D neuroimaging, focusing on model interpretability for clinical validation.",
        "Advanced diagnostic capabilities for physically impaired patients by pioneering deep learning models that translate structural MRI data into functional brain connectivity maps.",
        "Partnered with Roche Pharma's R&D teams to demonstrate the commercial potential of the research, successfully translating academic findings into scalable models for early drug development and biomarker discovery."
      ],
      "tech": [
        "multimodal AI",
        "3D neuroimaging",
        "biomarkers",
        "data-fusion",
        "LLM",
        "vision language models",
        "deep learning",
        "MRI"
      ]
    },
    {
      "id": "exp-3",
      "title": "Management Consultant",
      "company": "Careers Service, University of Oxford",
      "location": "Oxford, United Kingdom",
      "start": "2021-09",
      "end": "2021-09",
      "current": false,
      "bullets_raw": [
        "Directed a management consulting project for a local insurance broker, leading a team of five consultants to develop and deliver a new customer segmentation and go-to-market strategy that the client immediately adopted."
      ],
      "tech": [
        "management consulting",
        "customer segmentation",
        "go-to-market strategy"
      ]
    },
    {
      "id": "exp-4",
      "title": "Software Engineer",
      "company": "GE Healthcare",
      "location": "Oxford, United Kingdom",
      "start": "2019-10",
      "end": "2020-10",
      "current": false,
      "bullets_raw": [
        "Spearheaded the integration and optimization of a deep learning model for an open-source MRI software, delivering a 12% increase in Alzheimer's imaging segmentation accuracy and reducing analysis time by 90%."
      ],
      "tech": [
        "deep learning",
        "MRI",
        "image segmentation"
      ]
    },
    {
      "id": "exp-5",
      "title": "MEng Student — Developing Deep Reinforcement-Learning Agents",
      "company": "The University of Sheffield",
      "location": "Sheffield, United Kingdom",
      "start": "2018-09",
      "end": "2019-05",
      "current": false,
      "bullets_raw": [
        "Pioneered an investigation into neuromorphic AI, validating the feasibility of training reinforcement learning agents with a biologically plausible algorithm (direct feedback alignment) and producing a comprehensive performance analysis that benchmarked the trade-offs between biological plausibility and raw task performance."
      ],
      "tech": [
        "neuromorphic AI",
        "reinforcement learning",
        "direct feedback alignment"
      ]
    },
    {
      "id": "exp-6",
      "title": "Engineering Consultant",
      "company": "Siemens",
      "location": "Sheffield, United Kingdom",
      "start": "2018-09",
      "end": "2018-12",
      "current": false,
      "bullets_raw": [
        "Orchestrated a multidisciplinary engineering review of hydrogen fuel safety practices at the Siemens LCCC facility, delivering re-engineered system designs and process improvements that enabled critical facility expansion."
      ],
      "tech": [
        "hydrogen fuel safety",
        "system design"
      ]
    },
    {
      "id": "exp-7",
      "title": "Research Engineer",
      "company": "Rolls-Royce",
      "location": "Derby, United Kingdom",
      "start": "2017-06",
      "end": "2018-09",
      "current": false,
      "bullets_raw": [
        "Drove the strategic case for entering the regional and eVTOL hybrid-electric aviation market, delivering agent-based models and simulations that directly enabled the establishment of two new business lines valued at over $840M annually.",
        "Advised the Group CTO, senior leadership, and external partners on long-term technology strategy, translating market analysis and horizon scanning of 120+ technologies into actionable business insights that shaped the company's R&D roadmap.",
        "Provided critical analysis for internal consultancy projects across diverse deep-tech sectors, including  Small Modular Reactors (SMR), robotics, and VR/AR.",
        "Played a key role in commercial negotiations, supporting the successful signing of strategic consultancy and partnership agreements."
      ],
      "tech": [
        "agent-based models",
        "hybrid-electric aviation",
        "eVTOL",
        "SMR",
        "robotics",
        "VR/AR"
      ]
    },
    {
      "id": "exp-8",
      "title": "Research Engineer (Intern)",
      "company": "Rolls-Royce",
      "location": "Derby, United Kingdom",
      "start": "2016-06",
      "end": "2016-09",
      "current": false,
      "bullets_raw": [
        "Pioneered a PoC 3D defect detection algorithm that accelerated critical inspection processes by 50%, serving as a key enabler for launching a new business unit focused on inspection automation."
      ],
      "tech": [
        "3D defect detection",
        "inspection automation"
      ]
    }
  ],
  "volunteering": [
    {
      "id": "vol-1",
      "title": "Mentor",
      "company": "Romanian Science Festival",
      "location": "Timisoara, Romania",
      "start": "2023-04",
      "end": "2024-06",
      "bullets_raw": [
        "Mentored Romanian school pupils and students on various topics, from AI to personal and career development.",
        "Promoted non-formal science education to young people, school students, and academics from Romania.",
        "Helped to organise the festival in Timisoara (2023), as well as several webinars and workshops attended by 1000+ students and teachers, discussing topics from career opportunities in AI to the ethics of AI.",
        "Gave press interviews, promoting RSF's work and future events"
      ]
    },
    {
      "id": "vol-2",
      "title": "Project Manager",
      "company": "Project Phoenix",
      "location": "Sheffield, United Kingdom",
      "start": "2016-02",
      "end": "2016-12",
      "bullets_raw": [
        "Founder of Project Phoenix, the largest student-led project at the University of Sheffield, aiming at constructing and flying a full-scale aircraft, recruiting 50 students from multiple disciplines, and raising £25k from sponsors",
        "Coordinated a multidisciplinary project management team of 15 students, liaising with the university and other stakeholders, improving the project’s media outlook and visibility, and directing the acquisition of tools and materials"
      ]
    },
    {
      "id": "vol-3",
      "title": "Rolls-Royce Campus Team Member",
      "company": "Rolls-Royce",
      "start": "2017-09",
      "end": "2018-09",
      "bullets_raw": [
        "Facilitated recruiting students from the University of Sheffield and Sheffield Hallam University by delivering presentations, running workshops and facility tours, and attending careers fairs."
      ]
    },
    {
      "id": "vol-4",
      "title": "Lead Propulsion Systems Engineer",
      "company": "European Space Agency",
      "start": "2018-01",
      "end": "2018-01",
      "bullets_raw": [
        "Cooperated with a multidisciplinary international team from 12 countries, developing a mission aimed at scanning for lunar water."
      ]
    },
    {
      "id": "vol-5",
      "title": "Young Persons Committee Member, National Undergraduate Representative",
      "company": "Royal Aeronautical Society",
      "start": "2014-12",
      "end": "2016-07",
      "bullets_raw": [
        "National undergraduate students representative, advising the Committee on best practices for increasing recruitment and retention.",
        "Drafted a new package for branches, facilitating better marketing to local universities, and a new Communication Strategy for the whole Young Persons Network.",
        "Organised lectures, conferences, and talks, promoting the benefits of a career in aerospace engineering and joining the Society."
      ]
    },
    {
      "id": "vol-6",
      "title": "President",
      "company": "Simurq Aeronautics",
      "start": "2014-09",
      "end": "2016-05",
      "bullets_raw": [
        "Propulsion system designer and then President (May 2015 onward) of Simurq Aeronautics, a student society at the University of Sheffield, aiming at designing, building, and flying UAVs and a human-powered aircraft.",
        "Overhauled the society's management structure and projects, resulting in a leaner organisation structure and improved competition results."
      ]
    }
  ],
  "projects": [
    {
      "name": "Quantifying Brain Ageing using AI and Multi-Modal Neuroimaging Datasets",
      "role": null,
      "link": null,
      "bullets_raw": [
        "Developed novel multimodal AI and data science algorithms to analyze large-scale neuroimaging datasets from the UK Biobank, identifying 191 statistically significant factors in brain aging and discovering 57 potential new biomarkers. Work was presented at IEEE SDS 2023 and conducted in collaboration with Roche Pharma."
      ],
      "tech": [
        "multimodal AI",
        "data science",
        "neuroimaging",
        "biomarkers"
      ]
    },
    {
      "name": "Paint4Brains: Open-Source AI-Powered Segmentation Tool",
      "role": null,
      "link": null,
      "bullets_raw": [
        "Developed and open-sourced 'Paint4Brains,' a deep learning-based MRI software that boosted Alzheimer's imaging segmentation accuracy by 12% and accelerated analysis speeds by 90% for patients showing advanced brain degeneration, during a part-time engagement with GE Healthcare."
      ],
      "tech": [
        "deep learning",
        "MRI",
        "image segmentation"
      ]
    },
    {
      "name": "Rolls-Royce - EVTOL Concept",
      "role": null,
      "link": "https://www.rolls-royce.com/media/our-stories/discover/2018/blue-sky-thinking-rr-unveils-evtol-concept-at-farnborough-airshow.aspx",
      "bullets_raw": [
        "My work has focused mostly on the fuselage sizing and design, as well as the initial sizing of the propulsion system. I was also involved in some market analysis aspects concerning the EVTOL.  "
      ],
      "tech": [
        "fuselage sizing",
        "propulsion system",
        "market analysis",
        "EVTOL"
      ]
    },
    {
      "name": "Rolls-Royce - Electrification in Aviation",
      "role": null,
      "link": null,
      "bullets_raw": [
        "I performed an investigation into the disruptive impact of electrification in aviation, assessing the feasibility of different conventional and novel aircraft architectures and designs, and quantifying the market impact of certain design characteristics."
      ],
      "tech": [
        "electrification",
        "aircraft architectures"
      ]
    }
  ],
  "education": [
    {
      "degree": "Doctor of Philosophy (DPhil)",
      "field": "Quantifying Brain Ageing using Deep Learning and Large Neuroimaging & Biomedical Datasets",
      "institution": "University of Oxford",
      "location": "Oxford, United Kingdom",
      "start": "2019-09",
      "end": "2024-12",
      "honors_raw": [
        "Industrial Fellowship from the Royal Commission for the Exhibition of 1851, worth £51k (2021)",
        "Top-100 Biotech Leader of Tomorrow at GapSummit 2020"
      ]
    },
    {
      "degree": "Master of Engineering (MEng)",
      "field": "Aerospace Engineering with a Year in Industry",
      "institution": "The University of Sheffield",
      "location": "Sheffield, United Kingdom",
      "start": "2014-09",
      "end": "2019-06",
      "honors_raw": [
        "First-Class Honours (Valedictorian)",
        "Mappin Medal and Premium (2019)",
        "Special Distinction for Excellence from the League of Romanian Students Abroad (LSRS) (2018)",
        "Sir Harold West Award (2015)",
        "Best Communicated Solution from Engineers Without Borders (2015)"
      ]
    },
    {
      "degree": "High-School Diploma",
      "field": "Mathematics & Computer Science",
      "institution": "\"Petru Rares\" National College",
      "location": "Piatra Neamt, Romania",
      "start": "2010-09",
      "end": "2014-06",
      "honors_raw": [
        "Grade: 95%"
      ]
    }
  ],
  "certifications": [
    {
      "name": "Introduction to Corporate Finance",
      "issuer": "The Wharton School",
      "date": "2025-01",
      "topics_raw": []
    },
    {
      "name": "Managing Social and Human Capital",
      "issuer": "The Wharton School",
      "date": "2024-12",
      "topics_raw": []
    },
    {
      "name": "Introduction to Financial Accounting",
      "issuer": "The Wharton School",
      "date": "2024-12",
      "topics_raw": []
    },
    {
      "name": "Introduction to Project Management",
      "issuer": "IBM",
      "date": "2024-12",
      "topics_raw": []
    },
    {
      "name": "Introduction to Marketing",
      "issuer": "The Wharton School",
      "date": "2024-10",
      "topics_raw": []
    },
    {
      "name": "Essential Edge AI with Renesas RZ/V2L",
      "issuer": "Doulos",
      "date": "2023-01",
      "topics_raw": []
    },
    {
      "name": "Introduction to Health Economic Evaluation",
      "issuer": "University of Oxford",
      "date": "2022-05",
      "topics_raw": []
    },
    {
      "name": "AI for Medicine Specialization",
      "issuer": "Coursera",
      "date": "2020-11",
      "topics_raw": []
    },
    {
      "name": "Deep Learning Specialization",
      "issuer": "Coursera",
      "date": "2018-10",
      "topics_raw": []
    },
    {
      "name": "Certificate of English as a Foreign Language",
      "issuer": "Educational Testing Service (ETS)",
      "date": "2013-09"
    },
    {
      "name": "Democratic Development",
      "issuer": "Coursera",
      "date": "2014-01"
    },
    {
      "name": "Concurrent Engineering Workshop",
      "issuer": "European Space Agency - ESA",
      "date": "2018-02"
    },
    {
      "name": "Machine Learning",
      "issuer": "Coursera",
      "date": "2018-03"
    },
    {
      "name": "Neural Networks and Deep Learning",
      "issuer": "Coursera",
      "date": "2018-07"
    },
    {
      "name": "Improving Deep Neural Networks: Hyperparameter tuning, Regularization and Optimization",
      "issuer": "Coursera",
      "date": "2018-08"
    },
    {
      "name": "Structuring Machine Learning Projects",
      "issuer": "Coursera",
      "date": "2018-09"
    },
    {
      "name": "Convolutional Neural Networks",
      "issuer": "Coursera",
      "date": "2018-09"
    },
    {
      "name": "Sequence Models",
      "issuer": "Coursera",
      "date": "2018-10"
    },
    {
      "name": "Artificial Intelligence: Reinforcement Learning in Python",
      "issuer": "Udemy",
      "date": "2018-10"
    },
    {
      "name": "Deep Learning Prerequisites: The Numpy Stack in Python",
      "issuer": "Udemy",
      "date": "2019-12"
    },
    {
      "name": "Deep Learning: GANs and Variational Autoencoders",
      "issuer": "Udemy",
      "date": "2020-02"
    },
    {
      "name": "AI for Medical Prognosis",
      "issuer": "Coursera",
      "date": "2020-07"
    },
    {
      "name": "AI for Medical Diagnosis",
      "issuer": "Coursera",
      "date": "2020-07"
    },
    {
      "name": "AI For Medical Treatment",
      "issuer": "Coursera",
      "date": "2020-11"
    },
    {
      "name": "Deep Learning Prerequisites: Linear Regression in Python",
      "issuer": "Udemy",
      "date": "2021-04"
    },
    {
      "name": "Deep Learning Prerequisites: Logistic Regression in Python",
      "issuer": "Udemy",
      "date": "2021-05"
    },
    {
      "name": "Data Science: Supervised Machine Learning in Python",
      "issuer": "Udemy",
      "date": "2021-05"
    },
    {
      "name": "Bayesian Machine Learning in Python: A/B Testing",
      "issuer": "Udemy",
      "date": "2021-05"
    },
    {
      "name": "Data Science: Deep Learning and Neural Networks in Python",
      "issuer": "Udemy",
      "date": "2022-02"
    }




  ],
  "languages": [
    {
      "language": "English",
      "cefr": "C2",
      "native": true,
      "proficiency_raw": "Native"
    },
    {
      "language": "Romanian",
      "cefr": null,
      "native": true,
      "proficiency_raw": "Native"
    },
    {
      "language": "French",
      "cefr": "B1",
      "native": false,
      "proficiency_raw": "Limited Working"
    },
    {
      "language": "German",
      "cefr": "A1",
      "native": false,
      "proficiency_raw": "Elementary"
    }
  ],
  "interests_raw": [],
  "references_note": null,
  "meta": {
    "source_file": "linkedin.json",
    "notes": "Personal data (DOB, nationality, full address) and interests are not available from the LinkedIn source data.",
    "uuid": null
  }
}